thereivn/LAB6-NRV-SMO/esp32/output/ESP32_CAM_Results_model.h
/* Simulation code for ESP32_CAM_Thermal_Energy generated by the OpenModelica Compiler OpenModelica 1.22.1. */
#if !defined(_output_ESP32_CAM_Results__MODEL_H)
#define _output_ESP32_CAM_Results__MODEL_H

#include "openmodelica.h"
#include "openmodelica_func.h"
#include "simulation_data.h"
#include "simulation/simulation_info_json.h"
#include "simulation/simulation_runtime.h"
#include "util/omc_error.h"
#include "util/parallel_helper.h"
#include "simulation/jacobian_util.h"
#include "simulation/simulation_omc_assert.h"
#include "simulation/solver/model_help.h"
#include "simulation/solver/delay.h"
#include "simulation/solver/linearSystem.h"
#include "simulation/solver/nonlinearSystem.h"
#include "simulation/solver/mixedSystem.h"
#include "simulation/solver/spatialDistribution.h"

#if defined(__cplusplus)
extern "C" {
#endif

#include <string.h>

#include "/output/ESP32_CAM_Results_functions.h"


extern void _output_ESP32_CAM_Results_callExternalObjectDestructors(DATA *_data, threadData_t *threadData);
#if !defined(OMC_NUM_NONLINEAR_SYSTEMS) || OMC_NUM_NONLINEAR_SYSTEMS>0
#endif
#if !defined(OMC_NUM_LINEAR_SYSTEMS) || OMC_NUM_LINEAR_SYSTEMS>0
extern void _output_ESP32_CAM_Results_initialLinearSystem(int nLinearSystems, LINEAR_SYSTEM_DATA *data);
#endif
#if !defined(OMC_NUM_MIXED_SYSTEMS) || OMC_NUM_MIXED_SYSTEMS>0
#endif
#if !defined(OMC_NO_STATESELECTION)
extern void _output_ESP32_CAM_Results_initializeStateSets(int nStateSets, STATE_SET_DATA* statesetData, DATA *data);
#endif
extern int _output_ESP32_CAM_Results_functionAlgebraics(DATA *data, threadData_t *threadData);
extern int _output_ESP32_CAM_Results_function_storeDelayed(DATA *data, threadData_t *threadData);
extern int _output_ESP32_CAM_Results_function_storeSpatialDistribution(DATA *data, threadData_t *threadData);
extern int _output_ESP32_CAM_Results_function_initSpatialDistribution(DATA *data, threadData_t *threadData);
extern int _output_ESP32_CAM_Results_updateBoundVariableAttributes(DATA *data, threadData_t *threadData);
extern int _output_ESP32_CAM_Results_functionInitialEquations(DATA *data, threadData_t *threadData);
extern int _output_ESP32_CAM_Results_functionInitialEquations_lambda0(DATA *data, threadData_t *threadData);
extern int _output_ESP32_CAM_Results_functionRemovedInitialEquations(DATA *data, threadData_t *threadData);
extern int _output_ESP32_CAM_Results_updateBoundParameters(DATA *data, threadData_t *threadData);
extern int _output_ESP32_CAM_Results_checkForAsserts(DATA *data, threadData_t *threadData);
extern int _output_ESP32_CAM_Results_function_ZeroCrossingsEquations(DATA *data, threadData_t *threadData);
extern int _output_ESP32_CAM_Results_function_ZeroCrossings(DATA *data, threadData_t *threadData, double* gout);
extern int _output_ESP32_CAM_Results_function_updateRelations(DATA *data, threadData_t *threadData, int evalZeroCross);
extern const char* _output_ESP32_CAM_Results_zeroCrossingDescription(int i, int **out_EquationIndexes);
extern const char* _output_ESP32_CAM_Results_relationDescription(int i);
extern void _output_ESP32_CAM_Results_function_initSample(DATA *data, threadData_t *threadData);
extern int _output_ESP32_CAM_Results_initialAnalyticJacobianG(DATA* data, threadData_t *threadData, ANALYTIC_JACOBIAN *jacobian);
extern int _output_ESP32_CAM_Results_initialAnalyticJacobianA(DATA* data, threadData_t *threadData, ANALYTIC_JACOBIAN *jacobian);
extern int _output_ESP32_CAM_Results_initialAnalyticJacobianB(DATA* data, threadData_t *threadData, ANALYTIC_JACOBIAN *jacobian);
extern int _output_ESP32_CAM_Results_initialAnalyticJacobianC(DATA* data, threadData_t *threadData, ANALYTIC_JACOBIAN *jacobian);
extern int _output_ESP32_CAM_Results_initialAnalyticJacobianD(DATA* data, threadData_t *threadData, ANALYTIC_JACOBIAN *jacobian);
extern int _output_ESP32_CAM_Results_initialAnalyticJacobianF(DATA* data, threadData_t *threadData, ANALYTIC_JACOBIAN *jacobian);
extern int _output_ESP32_CAM_Results_initialAnalyticJacobianH(DATA* data, threadData_t *threadData, ANALYTIC_JACOBIAN *jacobian);
extern int _output_ESP32_CAM_Results_functionJacG_column(DATA* data, threadData_t *threadData, ANALYTIC_JACOBIAN *thisJacobian, ANALYTIC_JACOBIAN *parentJacobian);
extern int _output_ESP32_CAM_Results_functionJacA_column(DATA* data, threadData_t *threadData, ANALYTIC_JACOBIAN *thisJacobian, ANALYTIC_JACOBIAN *parentJacobian);
extern int _output_ESP32_CAM_Results_functionJacB_column(DATA* data, threadData_t *threadData, ANALYTIC_JACOBIAN *thisJacobian, ANALYTIC_JACOBIAN *parentJacobian);
extern int _output_ESP32_CAM_Results_functionJacC_column(DATA* data, threadData_t *threadData, ANALYTIC_JACOBIAN *thisJacobian, ANALYTIC_JACOBIAN *parentJacobian);
extern int _output_ESP32_CAM_Results_functionJacD_column(DATA* data, threadData_t *threadData, ANALYTIC_JACOBIAN *thisJacobian, ANALYTIC_JACOBIAN *parentJacobian);
extern int _output_ESP32_CAM_Results_functionJacF_column(DATA* data, threadData_t *threadData, ANALYTIC_JACOBIAN *thisJacobian, ANALYTIC_JACOBIAN *parentJacobian);
extern int _output_ESP32_CAM_Results_functionJacH_column(DATA* data, threadData_t *threadData, ANALYTIC_JACOBIAN *thisJacobian, ANALYTIC_JACOBIAN *parentJacobian);
extern const char* _output_ESP32_CAM_Results_linear_model_frame(void);
extern const char* _output_ESP32_CAM_Results_linear_model_datarecovery_frame(void);
extern int _output_ESP32_CAM_Results_mayer(DATA* data, modelica_real** res, short *);
extern int _output_ESP32_CAM_Results_lagrange(DATA* data, modelica_real** res, short *, short *);
extern int _output_ESP32_CAM_Results_pickUpBoundsForInputsInOptimization(DATA* data, modelica_real* min, modelica_real* max, modelica_real*nominal, modelica_boolean *useNominal, char ** name, modelica_real * start, modelica_real * startTimeOpt);
extern int _output_ESP32_CAM_Results_setInputData(DATA *data, const modelica_boolean file);
extern int _output_ESP32_CAM_Results_getTimeGrid(DATA *data, modelica_integer * nsi, modelica_real**t);
extern void _output_ESP32_CAM_Results_function_initSynchronous(DATA * data, threadData_t *threadData);
extern void _output_ESP32_CAM_Results_function_updateSynchronous(DATA * data, threadData_t *threadData, long base_idx);
extern int _output_ESP32_CAM_Results_function_equationsSynchronous(DATA * data, threadData_t *threadData, long base_idx, long sub_idx);
extern void _output_ESP32_CAM_Results_read_input_fmu(MODEL_DATA* modelData, SIMULATION_INFO* simulationData);
extern void _output_ESP32_CAM_Results_function_savePreSynchronous(DATA *data, threadData_t *threadData);
extern int _output_ESP32_CAM_Results_inputNames(DATA* data, char ** names);
extern int _output_ESP32_CAM_Results_dataReconciliationInputNames(DATA* data, char ** names);
extern int _output_ESP32_CAM_Results_dataReconciliationUnmeasuredVariables(DATA* data, char ** names);
extern int _output_ESP32_CAM_Results_initializeDAEmodeData(DATA *data, DAEMODE_DATA*);
extern int _output_ESP32_CAM_Results_functionLocalKnownVars(DATA* data, threadData_t* threadData);
extern int _output_ESP32_CAM_Results_symbolicInlineSystem(DATA* data, threadData_t* threadData);

#include "/output/ESP32_CAM_Results_literals.h"




#if defined(HPCOM) && !defined(_OPENMP)
  #error "HPCOM requires OpenMP or the results are wrong"
#endif
#if defined(_OPENMP)
  #include <omp.h>
#else
  /* dummy omp defines */
  #define omp_get_max_threads() 1
#endif

#if defined(__cplusplus)
}
#endif

#endif /* !defined(_output_ESP32_CAM_Results__MODEL_H) */


